/*======================================================================================================
* @文件名称	:                                                       
* @文件描述	: 	MCCore DSP执行母线解耦运算
* @创建人		:  	张宇                                                                              
* 创建日期		:   	2020-09-27                                                                 
* 修改记录		:   
*            
======================================================================================================*/

#include "MCCore_BusVolDecoupler.h"

/**************************************************************************************************************************************************
* @函数名		:  		DSPCore_CfgBusVolDecoupler                                                        
* @函数描述	: 		
* @创建人		:    		张宇                                                                            
* 创建日期		:   		2020-09-27                                                          
* 修改记录		:   			
*                         
****************************************************************************************************************************************************/
bool DSPCore_CfgBusVolDecoupler(stBusVolDecoupler* pBus)
{
	return TRUE;
}
/**************************************************************************************************************************************************
* @函数名		:  		DSPCore_DoBusVolDecoupler
* @函数描述	: 		执行速度环计算
* @创建人		:    		张宇                                                                            
* 创建日期		:   		2020-09-27                                                             
* 修改记录		:   			
*                         
****************************************************************************************************************************************************/
bool DSPCore_DoBusVolDecoupler(stBusVolDecoupler* pBus)
{
	INT16S s32Tmp = 0;
	s32Tmp = GetADResultModifyDef(AD_12VP,m1HalPara.ADGain,m1HalPara.ADOff)  << 2;// 归一化到[-8192,8191]
	pBus ->V_Bus =  (INT16S)FirCalc(&CoreVBusFdbFir, s32Tmp, 1);
	s32Tmp = ((INT32S)pBus ->V_Bus << 13)/pBus->RatedVolBit;
	s32Tmp = LIMITMAXMIN(s32Tmp, 16383, 4096);
	pBus ->VBusProtect = m1CurrLoopCtler.MotCtl.bit.EnBusModify?s32Tmp:8192;
	pBus->BusCoef = (1L << 26)/pBus ->VBusProtect;
	return TRUE;

}

